import {
  ChipIcon,
  CursorIcon,
  MessageIcon,
  ScalingIcon,
} from "@/components/icons";

export const serversPlansListData = {
  base: [
    {
      icon: <CursorIcon />,
      text: "Доступ к оборудованию",
    },
  ],

  standart: [
    {
      icon: <CursorIcon />,
      text: "Доступ к оборудованию",
    },
    {
      icon: <ScalingIcon />,
      text: "Возможность масштабирования",
    },
  ],

  prof: [
    {
      icon: <CursorIcon />,
      text: "Доступ к оборудованию",
    },
    {
      icon: <ScalingIcon />,
      text: "Возможность масштабирования",
    },
    {
      icon: <ChipIcon />,
      text: "Доступ к новейшему оборудованию",
    },
  ],

  premium: [
    {
      icon: <CursorIcon />,
      text: "Доступ к оборудованию",
    },
    {
      icon: <ScalingIcon />,
      text: "Возможность масштабирования",
    },
    {
      icon: <MessageIcon />,
      text: "Круглосуточная поддержка",
    },
    {
      icon: <ChipIcon />,
      text: "Доступ к новейшему оборудованию",
    },
  ],

  beneficial: [
    {
      icon: <CursorIcon />,
      text: "Доступ к оборудованию",
    },
    {
      icon: <ScalingIcon />,
      text: "Возможность масштабирования",
    },
    {
      icon: <MessageIcon />,
      text: "Круглосуточная поддержка",
    },
  ],

  elite: [
    {
      icon: <CursorIcon />,
      text: "Доступ к оборудованию",
    },
    {
      icon: <ScalingIcon />,
      text: "Возможность масштабирования",
    },
    {
      icon: <MessageIcon />,
      text: "Круглосуточная поддержка",
    },

    {
      icon: <ChipIcon />,
      text: "Доступ к новейшему оборудованию",
    },
    {
      icon: (
        <svg width="21" height="20" viewBox="0 0 21 20" fill="none">
          <path
            d="M14.0667 3.53385L9.45833 11.6005C9.3697 11.754 9.36892 11.9429 9.4563 12.0971C9.54367 12.2513 9.70613 12.3477 9.88333 12.3505H12.5083C13.056 12.3505 13.5 12.7945 13.5 13.3422V16.6755C13.5006 16.8958 13.6453 17.0897 13.8563 17.153C14.0673 17.2163 14.2949 17.1341 14.4167 16.9505L18.95 10.1422C19.0518 9.99136 19.0619 9.79665 18.9764 9.63606C18.8909 9.47546 18.7236 9.37524 18.5417 9.37552H15.95C15.3977 9.37552 14.95 8.9278 14.95 8.37552V3.75885C14.923 3.56035 14.7783 3.39806 14.5842 3.34861C14.39 3.29916 14.1853 3.37244 14.0667 3.53385Z"
            fill="#5B39B8"
          />
          <path
            d="M7.625 6.75885H3.625C3.27982 6.75885 3 6.47903 3 6.13385C3 5.78867 3.27982 5.50885 3.625 5.50885H7.625C7.97018 5.50885 8.25 5.78867 8.25 6.13385C8.25 6.47903 7.97018 6.75885 7.625 6.75885Z"
            fill="#5B39B8"
          />
          <path
            d="M6.625 10.7005H2.625C2.40171 10.7005 2.19538 10.5814 2.08373 10.388C1.97209 10.1946 1.97209 9.95639 2.08373 9.76302C2.19538 9.56964 2.40171 9.45052 2.625 9.45052H6.625C6.97018 9.45052 7.25 9.73034 7.25 10.0755C7.25 10.4207 6.97018 10.7005 6.625 10.7005Z"
            fill="#5B39B8"
          />
          <path
            d="M7.625 15.5089H3.625C3.27982 15.5089 3 15.229 3 14.8839C3 14.5387 3.27982 14.2589 3.625 14.2589H7.625C7.97018 14.2589 8.25 14.5387 8.25 14.8839C8.25 15.229 7.97018 15.5089 7.625 15.5089Z"
            fill="#5B39B8"
          />
        </svg>
      ),

      text: "Эксклюзивные условия",
    },
  ],
};
